In [4]:
import pandas as pd

In [5]:
frame = pd.DataFrame({'numbers': range(10), 'chars': ['a']*10})

In [6]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [8]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [9]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [10]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [11]:
frame.shape

(6, 4)

In [12]:
new_line = {'Name': 'Petrov', 'City': 'Penza'}

In [13]:
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov         NaN      Penza       NaN

In [14]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [15]:
frame = frame.append(new_line, ignore_index=True)

In [16]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov         NaN      Penza       NaN

In [17]:
frame['IsStudent'] = [False]*5 + [True]*2

In [18]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6           Petrov         NaN      Penza       NaN      True

In [19]:
frame.drop([5,6], axis=0)

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False

In [21]:
frame.drop([5,6], axis=0, inplace=True)

In [22]:
frame.drop(['IsStudent','City'], axis=1)

              Name       Birth  Position
0      Иванов А.А.  22.03.1980       NaN
1     Сорокин И.В.  07.08.1965   инженер
2       Белов М.М.  13.02.1980  менеджер
3  Мельникова Д.С.  15.04.1985       NaN
4      Рыбина Е.П.  19.11.1985   инженер

In [23]:
frame.drop(['IsStudent'], axis=1, inplace=True)

In [24]:
frame.to_csv('output_file.csv', sep=',', header=True, index=None)

In [25]:
!cat output_file.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

In [26]:
frame = pd.read_csv('dataset.tsv', sep='\t', header=0)

In [29]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [28]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [30]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [32]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 272.0+ bytes

In [35]:
frame.Position.fillna('paznorab', inplace=True)

In [36]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва  paznorab
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  paznorab
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [37]:
frame.Position

0    paznorab
1     инженер
2    менеджер
3    paznorab
4     инженер
5      стажер
Name: Position, dtype: object

In [38]:
frame[['Position']]

   Position
0  paznorab
1   инженер
2  менеджер
3  paznorab
4   инженер
5    стажер

In [39]:
frame.head(3)

           Name      Birth       City  Position
0   Иванов А.А. 1980-03-22     Москва  paznorab
1  Сорокин И.В. 1965-07-08  Волгоград   инженер
2    Белов М.М. 1980-02-13     Ростов  менеджер

In [42]:
frame[::3]

              Name      Birth    City  Position
0      Иванов А.А. 1980-03-22  Москва  paznorab
3  Мельникова Д.С. 1985-04-15  Ростов  paznorab

In [43]:
frame.loc[(1,3,5), ('Name', 'City')]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [45]:
frame.iloc[(1,3,5), (1, 3)]

       Birth  Position
1 1965-07-08   инженер
3 1985-04-15  paznorab
5 1985-05-31    стажер

In [49]:
a = frame.ix[(1,3,5), (1,3)]

In [50]:
a

       Birth  Position
1 1965-07-08   инженер
3 1985-04-15  paznorab
5 1985-05-31    стажер

In [51]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City  Position
3  Мельникова Д.С. 1985-04-15  Ростов  paznorab
4      Рыбина Е.П. 1985-11-19  Москва   инженер
5     Костров С.О. 1985-05-31  Москва    стажер

In [53]:
frame[frame['Birth'] >= pd.datetime(1985,1,1)]

              Name      Birth    City  Position
3  Мельникова Д.С. 1985-04-15  Ростов  paznorab
4      Рыбина Е.П. 1985-11-19  Москва   инженер
5     Костров С.О. 1985-05-31  Москва    стажер

In [2]:
frame[(frame.Birth >= pd.datetime(1,2,1996)) | (frame.city != 'Москва')]

SyntaxError: invalid syntax (<ipython-input-2-42264cee22dd>, line 1)